# %%
import pandas as pd
from os import listdir
from os.path import isfile, join
from difflib import SequenceMatcher
import itertools
# Clean Data
party_rename = {
    'Политическая партия«Народная партия «Ак Жол»': 'Ак Жол',
    'Партия коммунистов Кыргызстана': 'Партия коммунистов Кыргызстана',
    'Социал-демократическая партия Кыргызстана (СДПК)': 'СДПК',
    'Политическая партия«Народная партия «Ак Жол» ': 'Ак Жол',
    'Политическая партия «Народная партия «Ак Жол»': 'Ак Жол',
    'Политическая партия «Народная партия «Ак Жол» ': 'Ак Жол',
    '«АТА-ЖУРТ»': 'Ата-Журт',
    '«АР-НАМЫС»': 'Ар-Намыс',
    '«РЕСПУБЛИКА»': 'Республика',
    '«АТА МЕКЕН»': 'Ата Мекен',
    'Парламентская фракция «Бир Бол»': 'Бир Бол',
    'Парламентская фракция «Республика - Ата Журт»': 'Республика - Ата Журт',
    'Парламентская фракция «Кыргызстан»': 'Кыргызстан',
    'Парламентская фракция СДПК': 'СДПК',
    'Фракция «Онугуу-Прогресс»': 'Онугуу-Прогресс',
    'Парламентская фракция «Ата Мекен»': 'Ата Мекен',
    'Парламентская фракция «Онугуу-Прогресс»': 'Онугуу-Прогресс',
}

name_rename = {
    'ЭГЕМБЕРДИЕВ': 'Эгембердиев',
    '\\xa0': ' ',
    '\\r\\n': '',
    '   ': ' ',
    '  ': ' ',
    'Бабанов Өмүрбек Токтогулович': 'Бабанов Омурбек Токтогулович',
    'Нышанов Сайдулла Канболотович': 'Нышанов Сайдилла Канболотович',
    'Өмүркулов Иса Шейшенкулович': 'Омуркулов Иса Шейшенкулович',
    'Кудайбергенов Джаныш Камчибекович': 'Кудайбергенов Джаныш Камчыбекович',
    'Дербишева Гульнара Толубайевна': 'Дербишева Гульнара Толубаевна',
    'Жээнбеков Асилбек Шарипович': 'Жээнбеков Асылбек Шарипович',
    'Төрөбаев Бакыт Эргешевич': 'Торобаев Бакыт Эргешевич',
    'Юсуров Абдумеджит Лелезович': 'Юсуров Абдумажит Лелезович',
    'Кодуранова Асел Союзбековна': 'Кодуранова Асель Союзбековна',
    'Жумабеков Дастанбек Артисбекович': 'Джумабеков Дастанбек Артисбекович',
    'Рыспаев Кожобек Жайчыбекович': 'Рыспаев Кожобек Джайчыбекович',
    'Жетигенов Бакытбек Жеңишбекович': 'Джетигенов Бакытбек Дженишбекович',
    'Алтыбаева Айнуру Тойчиевна': 'Алтыбаева Айнура Тойчиевна',
    'Акматов Алмасбек Жумабекович': 'Акматов Алмазбек Жумабекович',
    'Асылбаева Гүлшат Кадыровна': 'Асылбаева Гюльшат Кадыровна',
    'Байбакпаев Экмат Журукпаевич': 'Байбакпаев Экмат Джурукпаевич',
    'Бакчиев Жаныбек Абдукапарович': 'Бакчиев Джаныбек Абдукапарович',
    'Жураев Сайдолимжон Маруфович': 'Джураев Сайдолимжон Маруфович',
    'Кадыкеев Нурланбек Кадыкеевич': 'Макеев Нурланбек Кадыкеевич',
    'Масабиров Талайбек Айтмаматович': 'Масабиров Таалайбек Айтмаматович',
    'Турускулов Жыргалбек Күрүчбекович': 'Турускулов Жыргалбек Куручбекович',
    'Алыбаев Орозбек Артильевич' : 'Алыбаев Орозбек Артельевич',
}


def clear_names(df):
    df.name = df.name.replace(name_rename, regex=True).str.strip()
    return df


def rename_party(df):
    try:
        df.party = df.party.replace(party_rename, regex=True)
        return df
    except:
        print("error in:", df)
        return df


csvs = []
paths = ['III', 'IV', 'V', 'VI']


for path in paths:
    path = "export/" + path
    csvs.extend([path + '/'+f for f in listdir(path) if isfile(join(path, f))])

dfs = (clear_names(rename_party(pd.read_csv(f))) for f in csvs)
concatenated_df = pd.concat(dfs, ignore_index=False)
len(concatenated_df.name.unique())

# %%


def similar(a, b):
    return SequenceMatcher(None, a, b).ratio()


def find_similar(df, col):
    cleanedList = [x for x in df[col].unique() if str(x) != 'nan']
    found_similar = {}
    for name, nextname in itertools.combinations(cleanedList, 2):
        if similar(name, nextname) > 0.8:
            print("similar", name, 'and', nextname, similar(name, nextname))
            found_similar.update({nextname: name})
    return found_similar


for col in ['name']:
    print(find_similar(concatenated_df, col))
# %%
name_tail_replace = {
    'Игоря': 'Игорь',
    'ева': 'ев',
    'ова': 'ов',
    'ича': 'ич',
    r'^(\w*\s+\w*)([а])\b': r'\1',
    r'^(\w*\s+\w*)([у])\b': r'\1а',
    r'^(\w*\s+\w*)([я])\b': r'\1й',
    r'^(\w*\s+\w*)([ю])\b': r'\1я',
    'еву': 'ева',
    'ову': 'ова',
    'евну': 'евна',
    'овну': 'овна',
    'ину': 'ина',
}
df = pd.read_csv('2010-12_V_raw.csv')
df.name = df.name.replace(name_tail_replace, regex=True)
df.to_csv('export/V/2010-12.csv', index=False)


# %%
